/*****************************************************************************/
/*  Copyright (C) 2019 Siemens Aktiengesellschaft. All rights reserved.      */
/*****************************************************************************/
/*  This program is protected by German copyright law and international      */
/*  treaties. The use of this software including but not limited to its      */
/*  Source Code is subject to restrictions as agreed in the license          */
/*  agreement between you and Siemens.                                       */
/*  Copying or distribution is not allowed unless expressly permitted        */
/*  according to your license agreement with Siemens.                        */
/*****************************************************************************/
/*                                                                           */
/*  P r o j e c t         &P: PROFINET IO Runtime Software              :P&  */
/*                                                                           */
/*  P a c k a g e         &W: PROFINET IO Runtime Software              :W&  */
/*                                                                           */
/*  C o m p o n e n t     &C: EDDI (EthernetDeviceDriver for IRTE)      :C&  */
/*                                                                           */
/*  F i l e               &F: eddi_Tra_NSC.c                            :F&  */

                                                            LSA_UINT32               const  HwPortIndex,
                                                            LSA_UINT16               const  LEDMode )
{
    LSA_UINT32  PhyLEDDirectControlReg;

    //control force-led-function via PHY register LED Direct Control
    EDDI_SwiPhyReadMDCA(EDDI_PHY_NSC_LED_DIRECT_CONTROL_REG_ADR, pDDB->Glob.PortParams[HwPortIndex].PhyAdr, &PhyLEDDirectControlReg, pDDB);
    EDDI_SetBitField32(&PhyLEDDirectControlReg, EDDI_PHY_NSC_LED_DIRECT_CONTROL_BIT__DRV_LNKLED, 1);
    EDDI_SetBitField32(&PhyLEDDirectControlReg, EDDI_PHY_NSC_LED_DIRECT_CONTROL_BIT__DRV_ACTLED, 1);
    EDDI_SetBitField32(&PhyLEDDirectControlReg, EDDI_PHY_NSC_LED_DIRECT_CONTROL_BIT__LNKLED, (LEDMode == EDDI_LED_MODE_ON) ? 0 : 1); //0 = LED On
    EDDI_SetBitField32(&PhyLEDDirectControlReg, EDDI_PHY_NSC_LED_DIRECT_CONTROL_BIT__ACTLED, (LEDMode == EDDI_LED_MODE_ON) ? 0 : 1); //0 = LED On
    EDDI_SwiPhyWriteMDCA(EDDI_PHY_NSC_LED_DIRECT_CONTROL_REG_ADR, pDDB->Glob.PortParams[HwPortIndex].PhyAdr, &PhyLEDDirectControlReg, pDDB);
}
/*---------------------- end [subroutine] ---------------------------------*/

/*=============================================================================
 * function name:  EDDI_TRALedBlinkEnd_NSC()
 *
 * function:       The EDDI calls this function within the service
 *                 EDD_SRV_LED_BLINK() after blinking of LED(s) has finished.
 *                 Can be used e.g. to re-enable the link/activity LED function of
 *                 a PHY if necessary.
 *
 * parameters:     
 *
 * return value:   LSA_VOID
 *===========================================================================*/
LSA_VOID  EDDI_LOCAL_FCT_ATTR  EDDI_TRALedBlinkEnd_NSC( EDDI_LOCAL_DDB_PTR_TYPE  const  pDDB,
                                                        LSA_UINT32               const  HwPortIndex )
{
    LSA_UINT32  PhyLEDDirectControlReg;

    //disable force-led-function via PHY register LED Direct Control
    EDDI_SwiPhyReadMDCA(EDDI_PHY_NSC_LED_DIRECT_CONTROL_REG_ADR, pDDB->Glob.PortParams[HwPortIndex].PhyAdr, &PhyLEDDirectControlReg, pDDB);
    EDDI_SetBitField32(&PhyLEDDirectControlReg, EDDI_PHY_NSC_LED_DIRECT_CONTROL_BIT__DRV_LNKLED, 0);
    EDDI_SetBitField32(&PhyLEDDirectControlReg, EDDI_PHY_NSC_LED_DIRECT_CONTROL_BIT__DRV_ACTLED, 0);
    EDDI_SwiPhyWriteMDCA(EDDI_PHY_NSC_LED_DIRECT_CONTROL_REG_ADR, pDDB->Glob.PortParams[HwPortIndex].PhyAdr, &PhyLEDDirectControlReg, pDDB);
}
/*---------------------- end [subroutine] ---------------------------------*/

#endif //EDDI_CFG_PHY_BLINK_EXTERNAL_NSC

#if defined (EDDI_CFG_ENABLE_PHY_REGDUMP_NSC)
/*=============================================================================
 * function name:  EDDI_TRARegDump_NSC()
 *
 * parameters:     
 *
 * return value:   LSA_VOID
 *===========================================================================*/
LSA_VOID  EDDI_LOCAL_FCT_ATTR  EDDI_TRARegDump_NSC( EDDI_LOCAL_DDB_PTR_TYPE  const  pDDB)
{

    struct _EDDI_PHY_REG_DUMP_NSC
    {
        //Standard regs
        LSA_UINT32  BMCR;     //00h Basic Mode Control Register
        LSA_UINT32  BMSR;     //01h Basic Mode Status Register
        LSA_UINT32  ANAR;     //04h Auto-Negotiation Advertisement Register
        LSA_UINT32  ANLPAR;   //05h Auto-Negotiation Link Partner Ability Register (Base Page)
        LSA_UINT32  ANER;     //06h Auto-Negotiation Expansion Register
        LSA_UINT32  ANNPTR;   //07h Auto-Negotiation Next Page TX
        LSA_UINT32  PHYSTS;  //10h PHYSTS PHY Status Register

        //Page 0
        LSA_UINT32  FCSCR;    //14h False Carrier Sense Counter Register
        LSA_UINT32  RECR;     //15h Receive Error Counter Register
        LSA_UINT32  PCSR;     //16h PCS Sub-Layer Configuration and Status Register
        LSA_UINT32  RBR;      //17h RMII and Bypass Register
        LSA_UINT32  PHYCR;    //19h PHY Control Register
        LSA_UINT32  TENBTSCR;  //1Ah 10Base-T Status/Control Register
        LSA_UINT32  CDCTRL1;  //1Bh CD Test Control Register and BIST Extensions Register
        LSA_UINT32  PHYCR2;   //1Ch Phy Control Register 2
        LSA_UINT32  EDCR;     //1Dh Energy    

        //Page 1
        LSA_UINT32  PMD_CNFG;  //14h

        //Page 2  
        LSA_UINT32  LEN100_DET; //14h 100Mb Length Detect Register
        LSA_UINT32  FREQ100;    //15h 100Mb Frequency Offset Indication Register
        LSA_UINT32  TDR_CTRL;   //16h TDR Control Register
        LSA_UINT32  TDR_WIN;    //17h TDR Window Register
        LSA_UINT32  TDR_PEAK;   //18h TDR Peak Measurement Register
        LSA_UINT32  TDR_THR;    //19h TDR Threshold Measurement Register
        LSA_UINT32  VAR_CTRL;   //1Ah Variance Control Register
        LSA_UINT32  VAR_DAT;    //1Bh Variance Data Register
        LSA_UINT32  LQMR;       //1Dh Link Quality Monitor Register
        LSA_UINT32  LQDR1Eh;    //1Eh Link Quality Data Register
    } RegDumpNSC;
 
    LSA_UINT32  HwPortIndex, UsrPortId;
  
    for (UsrPortId = 1; UsrPortId <= pDDB->PM.PortMap.PortCnt; UsrPortId++)
    {
        LSA_UINT32 PageSel;

        HwPortIndex = pDDB->PM.UsrPortID_to_HWPort_0_3[UsrPortId];
      
        EDDI_PROGRAM_TRACE_03(pDDB->Glob.TraceIdx, LSA_TRACE_LEVEL_WARN, "!!!Dump NSC PHY Regs HwPortIndex:%d, UsrPortId:%d, PhyAdr:0x%X", 
            HwPortIndex, UsrPortId, pDDB->Glob.PortParams[HwPortIndex].PhyAdr);

        //Read basic regs
        EDDI_SwiPhyReadMDCA(0x00, pDDB->Glob.PortParams[HwPortIndex].PhyAdr, &RegDumpNSC.BMCR, pDDB);
        EDDI_SwiPhyReadMDCA(0x01, pDDB->Glob.PortParams[HwPortIndex].PhyAdr, &RegDumpNSC.BMSR, pDDB);
        EDDI_SwiPhyReadMDCA(0x04, pDDB->Glob.PortParams[HwPortIndex].PhyAdr, &RegDumpNSC.ANAR, pDDB);
        EDDI_SwiPhyReadMDCA(0x05, pDDB->Glob.PortParams[HwPortIndex].PhyAdr, &RegDumpNSC.ANLPAR, pDDB);
